{
  "sergio_martinez": "Sergio Martínez - Resume",
  "web_developer": "Web developer",
  "personalInfo": "Personal information",
  "firstName": "Firt name",
  "lastName": "Last name",
  "age": "Age",
  "years": "years",
  "nationality": "Nationality",
  "argentinian": "Argentinian",
  "birthday": "Birthday",
  "status": "Status",
  "single": "Single",
  "address": "Address",
  "phone": "Phone",
  "id": "ID",
  "email": "E-mail",
  "skills": "Skills",
  "yearsExperience": "Years of experience",
  "languages": "Languages",
  "english": "English – B2",
  "spanish": "Spanish – Native",
  "iac": "1-year web design course at the IAC.",
  "utn": "1-year NodeJS and MongoDB course at UTN.",
  "educationIt": "4-month basic Android course in IT Education.",
  "socials": "Socials",
  "profile": "Profile",
  "education": "Education",
  "experience": "Experience",
  "aboutMe": "I'm a passionate <strong>React</strong> web developer with solid experience building high-performance web applications and exceptional user experiences. My focus is on building interactive and responsive user interfaces that not only meet technical standards but also provide an unmatched experience for end users.<br />My goal is to continue contributing to the success of challenging projects and take my experience in <strong>React</strong> and <strong>Node</strong> to the next level.",
  "jobs": [
    {
      "date": "2023 – Current",
      "position": "Software engineering in <strong>Ueno</strong>",
      "description": "Frontend developer for a Paraguayan bank, creating the new home banking system with micro frontends and BFF. UI development with a Material UI theme.<br /><strong>Development languages:</strong> NextJs and Fastify with TypeScript.<br /><strong>Tools used:</strong> Jira and Null."
    },
    {
      "date": "2021 – 2023",
      "position": "Software engineering in <strong>Capicua</strong>",
      "description": "Fullstack programmer for different projects in the USA, working with the latest development technologies; project design and architecture. Unit testing with Jest.<br /><strong>Development languages:</strong> React, Node.js and MongoDB with typescript. I work with international teams.<br /><strong>Tools used:</strong> AWS, Hasura and Jira."
    },
    {
      "date": "2019 – 2021",
      "position": "Software engineering in <strong>Santander Tecnología</strong>",
      "description": "Fullstack programmer for different intranet and back office projects at Santander Bank, development of the banking UI in React with TDD, design and architecture of the project and creation of BFF with Nest.js. Unit tests with Jest and integration test with Cypress.<br /><strong>Development languages:</strong> React, Node.js, Nest.js and MongoDB. I work in medium and large teams."
    },
    {
      "date": "2013 – 2019",
      "position": "Web Developer fullstack in <strong>W3</strong>",
      "description": "Frontend and backend programmer for both web and mobile websites, working with MVC using the optimal technologies for each type of project. CMS Drupal and Wordpress, Codeigniter Framework were used and server configurations were carried out in Windows XP2003.<br /><strong>Development languages:</strong> PHP, Codeigniter, Laravel, MySQL, MariaDB, GraphQL, MongoDB, Backbone. js, Angular.js, Node.js, React.js, ReactNative, Boostrap, CSS3 and HTML5.<br /><strong>Tools used:</strong> AWS, Azure, Jenkins, Jira and Bitbucket."
    },
    {
      "date": "2012 – 2013",
      "position": "Web Developer in <strong>Gameloft</strong>",
      "description": "Frontend and backend programmer of Facebook websites and applications, both web and mobile, working with MVC using the optimal technologies for each type of project. APIs such as Instagram, Twitter, Facebook and Vine were used and investigated.<br /><strong>Development languages:</strong> PHP, SQL, jQuery, CSS3, HTML5 and SASS."
    }
  ],
  "educations": [
    {
      "date": "2011 – 2012 (Abandoned)",
      "title": "Computer's Science",
      "from": "Buenos Aires' University"
    },
    {
      "date": "2010 (Finalized)",
      "title": "Computer Technician",
      "from": "Technical School N° 24 – Defense of Buenos Aires"
    }
  ]
}
